; ModuleID = 'xdp_prog_kern.c'
source_filename = "xdp_prog_kern.c"
target datalayout = "e-m:e-p:64:64-i64:64-n32:64-S128"
target triple = "bpf"

%struct.bpf_map_def = type { i32, i32, i32, i32, i32 }
%struct.xdp_md = type { i32, i32, i32, i32, i32 }
%struct.hdr_cursor = type { i8* }
%struct.collect_vlans = type { [2 x i16] }
%struct.ethhdr = type { [6 x i8], [6 x i8], i16 }
%struct.vlan_hdr = type { i16, i16 }
%struct.iphdr = type { i8, i8, i16, i16, i16, i8, i8, i16, i32, i32 }
%struct.ipv6hdr = type { i8, [3 x i8], i16, i8, i8, %struct.in6_addr, %struct.in6_addr }
%struct.in6_addr = type { %union.anon }
%union.anon = type { [4 x i32] }
%struct.icmphdr_common = type { i8, i8, i16 }
%struct.bpf_fib_lookup = type { i8, i8, i16, i16, i16, i32, %union.anon.0, %union.anon.1, %union.anon.2, i16, i16, [6 x i8], [6 x i8] }
%union.anon.0 = type { i32 }
%union.anon.1 = type { [4 x i32] }
%union.anon.2 = type { [4 x i32] }
%struct.newiphdr = type { i8, i8, i8, i8, i32, i32 }

@xdp_stats_map = dso_local global %struct.bpf_map_def { i32 6, i32 4, i32 16, i32 5, i32 0 }, section "maps", align 4, !dbg !0
@tx_port = dso_local global %struct.bpf_map_def { i32 14, i32 4, i32 4, i32 256, i32 0 }, section "maps", align 4, !dbg !76
@redirect_params = dso_local global %struct.bpf_map_def { i32 1, i32 6, i32 6, i32 1, i32 0 }, section "maps", align 4, !dbg !86
@__const.xdp_router_func.____fmt = private unnamed_addr constant [16 x i8] c"total size: %d\0A\00", align 1

!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 10.0.0-4ubuntu1 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !43, globals: !75, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "xdp_prog_kern.c", directory: "/home/rohit/cloned/New-IP/xdp/newip_router")
!4 = !{!5, !14}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "xdp_action", file: !6, line: 2845, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "../headers/linux/bpf.h", directory: "/home/rohit/cloned/New-IP/xdp/newip_router")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10, !11, !12, !13}
!9 = !DIEnumerator(name: "XDP_ABORTED", value: 0, isUnsigned: true)
!10 = !DIEnumerator(name: "XDP_DROP", value: 1, isUnsigned: true)
!11 = !DIEnumerator(name: "XDP_PASS", value: 2, isUnsigned: true)
!12 = !DIEnumerator(name: "XDP_TX", value: 3, isUnsigned: true)
!13 = !DIEnumerator(name: "XDP_REDIRECT", value: 4, isUnsigned: true)
!14 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !15, line: 28, baseType: !7, size: 32, elements: !16)
!15 = !DIFile(filename: "/usr/include/linux/in.h", directory: "")
!16 = !{!17, !18, !19, !20, !21, !22, !23, !24, !25, !26, !27, !28, !29, !30, !31, !32, !33, !34, !35, !36, !37, !38, !39, !40, !41, !42}
!17 = !DIEnumerator(name: "IPPROTO_IP", value: 0, isUnsigned: true)
!18 = !DIEnumerator(name: "IPPROTO_ICMP", value: 1, isUnsigned: true)
!19 = !DIEnumerator(name: "IPPROTO_IGMP", value: 2, isUnsigned: true)
!20 = !DIEnumerator(name: "IPPROTO_IPIP", value: 4, isUnsigned: true)
!21 = !DIEnumerator(name: "IPPROTO_TCP", value: 6, isUnsigned: true)
!22 = !DIEnumerator(name: "IPPROTO_EGP", value: 8, isUnsigned: true)
!23 = !DIEnumerator(name: "IPPROTO_PUP", value: 12, isUnsigned: true)
!24 = !DIEnumerator(name: "IPPROTO_UDP", value: 17, isUnsigned: true)
!25 = !DIEnumerator(name: "IPPROTO_IDP", value: 22, isUnsigned: true)
!26 = !DIEnumerator(name: "IPPROTO_TP", value: 29, isUnsigned: true)
!27 = !DIEnumerator(name: "IPPROTO_DCCP", value: 33, isUnsigned: true)
!28 = !DIEnumerator(name: "IPPROTO_IPV6", value: 41, isUnsigned: true)
!29 = !DIEnumerator(name: "IPPROTO_RSVP", value: 46, isUnsigned: true)
!30 = !DIEnumerator(name: "IPPROTO_GRE", value: 47, isUnsigned: true)
!31 = !DIEnumerator(name: "IPPROTO_ESP", value: 50, isUnsigned: true)
!32 = !DIEnumerator(name: "IPPROTO_AH", value: 51, isUnsigned: true)
!33 = !DIEnumerator(name: "IPPROTO_MTP", value: 92, isUnsigned: true)
!34 = !DIEnumerator(name: "IPPROTO_BEETPH", value: 94, isUnsigned: true)
!35 = !DIEnumerator(name: "IPPROTO_ENCAP", value: 98, isUnsigned: true)
!36 = !DIEnumerator(name: "IPPROTO_PIM", value: 103, isUnsigned: true)
!37 = !DIEnumerator(name: "IPPROTO_COMP", value: 108, isUnsigned: true)
!38 = !DIEnumerator(name: "IPPROTO_SCTP", value: 132, isUnsigned: true)
!39 = !DIEnumerator(name: "IPPROTO_UDPLITE", value: 136, isUnsigned: true)
!40 = !DIEnumerator(name: "IPPROTO_MPLS", value: 137, isUnsigned: true)
!41 = !DIEnumerator(name: "IPPROTO_RAW", value: 255, isUnsigned: true)
!42 = !DIEnumerator(name: "IPPROTO_MAX", value: 256, isUnsigned: true)
!43 = !{!44, !45, !46, !49, !74, !71}
!44 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!45 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!46 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u16", file: !47, line: 24, baseType: !48)
!47 = !DIFile(filename: "/usr/include/asm-generic/int-ll64.h", directory: "")
!48 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!49 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !50, size: 64)
!50 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "in6_addr", file: !51, line: 33, size: 128, elements: !52)
!51 = !DIFile(filename: "/usr/include/linux/in6.h", directory: "")
!52 = !{!53}
!53 = !DIDerivedType(tag: DW_TAG_member, name: "in6_u", scope: !50, file: !51, line: 40, baseType: !54, size: 128)
!54 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !50, file: !51, line: 34, size: 128, elements: !55)
!55 = !{!56, !62, !68}
!56 = !DIDerivedType(tag: DW_TAG_member, name: "u6_addr8", scope: !54, file: !51, line: 35, baseType: !57, size: 128)
!57 = !DICompositeType(tag: DW_TAG_array_type, baseType: !58, size: 128, elements: !60)
!58 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u8", file: !47, line: 21, baseType: !59)
!59 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!60 = !{!61}
!61 = !DISubrange(count: 16)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "u6_addr16", scope: !54, file: !51, line: 37, baseType: !63, size: 128)
!63 = !DICompositeType(tag: DW_TAG_array_type, baseType: !64, size: 128, elements: !66)
!64 = !DIDerivedType(tag: DW_TAG_typedef, name: "__be16", file: !65, line: 25, baseType: !46)
!65 = !DIFile(filename: "/usr/include/linux/types.h", directory: "")
!66 = !{!67}
!67 = !DISubrange(count: 8)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "u6_addr32", scope: !54, file: !51, line: 38, baseType: !69, size: 128)
!69 = !DICompositeType(tag: DW_TAG_array_type, baseType: !70, size: 128, elements: !72)
!70 = !DIDerivedType(tag: DW_TAG_typedef, name: "__be32", file: !65, line: 27, baseType: !71)
!71 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u32", file: !47, line: 27, baseType: !7)
!72 = !{!73}
!73 = !DISubrange(count: 4)
!74 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !70, size: 64)
!75 = !{!0, !76, !86, !88, !92, !156, !158, !166, !173, !180, !185, !192}
!76 = !DIGlobalVariableExpression(var: !77, expr: !DIExpression())
!77 = distinct !DIGlobalVariable(name: "tx_port", scope: !2, file: !3, line: 22, type: !78, isLocal: false, isDefinition: true)
!78 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bpf_map_def", file: !79, line: 108, size: 160, elements: !80)
!79 = !DIFile(filename: "../libbpf/src//build/usr/include/bpf/bpf_helpers.h", directory: "/home/rohit/cloned/New-IP/xdp/newip_router")
!80 = !{!81, !82, !83, !84, !85}
!81 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !78, file: !79, line: 109, baseType: !7, size: 32)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "key_size", scope: !78, file: !79, line: 110, baseType: !7, size: 32, offset: 32)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "value_size", scope: !78, file: !79, line: 111, baseType: !7, size: 32, offset: 64)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "max_entries", scope: !78, file: !79, line: 112, baseType: !7, size: 32, offset: 96)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "map_flags", scope: !78, file: !79, line: 113, baseType: !7, size: 32, offset: 128)
!86 = !DIGlobalVariableExpression(var: !87, expr: !DIExpression())
!87 = distinct !DIGlobalVariable(name: "redirect_params", scope: !2, file: !3, line: 29, type: !78, isLocal: false, isDefinition: true)
!88 = !DIGlobalVariableExpression(var: !89, expr: !DIExpression())
!89 = distinct !DIGlobalVariable(name: "_license", scope: !2, file: !3, line: 385, type: !90, isLocal: false, isDefinition: true)
!90 = !DICompositeType(tag: DW_TAG_array_type, baseType: !91, size: 32, elements: !72)
!91 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!92 = !DIGlobalVariableExpression(var: !93, expr: !DIExpression())
!93 = distinct !DIGlobalVariable(name: "stdin", scope: !2, file: !94, line: 137, type: !95, isLocal: false, isDefinition: false)
!94 = !DIFile(filename: "/usr/include/stdio.h", directory: "")
!95 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !96, size: 64)
!96 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !97, line: 7, baseType: !98)
!97 = !DIFile(filename: "/usr/include/bits/types/FILE.h", directory: "")
!98 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !99, line: 49, size: 1728, elements: !100)
!99 = !DIFile(filename: "/usr/include/bits/types/struct_FILE.h", directory: "")
!100 = !{!101, !103, !105, !106, !107, !108, !109, !110, !111, !112, !113, !114, !115, !118, !120, !121, !122, !125, !126, !128, !132, !135, !139, !142, !145, !146, !147, !151, !152}
!101 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !98, file: !99, line: 51, baseType: !102, size: 32)
!102 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !98, file: !99, line: 54, baseType: !104, size: 64, offset: 64)
!104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !91, size: 64)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !98, file: !99, line: 55, baseType: !104, size: 64, offset: 128)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !98, file: !99, line: 56, baseType: !104, size: 64, offset: 192)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !98, file: !99, line: 57, baseType: !104, size: 64, offset: 256)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !98, file: !99, line: 58, baseType: !104, size: 64, offset: 320)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !98, file: !99, line: 59, baseType: !104, size: 64, offset: 384)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !98, file: !99, line: 60, baseType: !104, size: 64, offset: 448)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !98, file: !99, line: 61, baseType: !104, size: 64, offset: 512)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !98, file: !99, line: 64, baseType: !104, size: 64, offset: 576)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !98, file: !99, line: 65, baseType: !104, size: 64, offset: 640)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !98, file: !99, line: 66, baseType: !104, size: 64, offset: 704)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !98, file: !99, line: 68, baseType: !116, size: 64, offset: 768)
!116 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !117, size: 64)
!117 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !99, line: 36, flags: DIFlagFwdDecl)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !98, file: !99, line: 70, baseType: !119, size: 64, offset: 832)
!119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !98, size: 64)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !98, file: !99, line: 72, baseType: !102, size: 32, offset: 896)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !98, file: !99, line: 73, baseType: !102, size: 32, offset: 928)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !98, file: !99, line: 74, baseType: !123, size: 64, offset: 960)
!123 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !124, line: 152, baseType: !45)
!124 = !DIFile(filename: "/usr/include/bits/types.h", directory: "")
!125 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !98, file: !99, line: 77, baseType: !48, size: 16, offset: 1024)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !98, file: !99, line: 78, baseType: !127, size: 8, offset: 1040)
!127 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !98, file: !99, line: 79, baseType: !129, size: 8, offset: 1048)
!129 = !DICompositeType(tag: DW_TAG_array_type, baseType: !91, size: 8, elements: !130)
!130 = !{!131}
!131 = !DISubrange(count: 1)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !98, file: !99, line: 81, baseType: !133, size: 64, offset: 1088)
!133 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !134, size: 64)
!134 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !99, line: 43, baseType: null)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !98, file: !99, line: 89, baseType: !136, size: 64, offset: 1152)
!136 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !124, line: 153, baseType: !137)
!137 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !124, line: 47, baseType: !138)
!138 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !98, file: !99, line: 91, baseType: !140, size: 64, offset: 1216)
!140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !141, size: 64)
!141 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !99, line: 37, flags: DIFlagFwdDecl)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !98, file: !99, line: 92, baseType: !143, size: 64, offset: 1280)
!143 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !144, size: 64)
!144 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !99, line: 38, flags: DIFlagFwdDecl)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !98, file: !99, line: 93, baseType: !119, size: 64, offset: 1344)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !98, file: !99, line: 94, baseType: !44, size: 64, offset: 1408)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !98, file: !99, line: 95, baseType: !148, size: 64, offset: 1472)
!148 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !149, line: 46, baseType: !150)
!149 = !DIFile(filename: "/usr/lib/llvm-10/lib/clang/10.0.0/include/stddef.h", directory: "")
!150 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !98, file: !99, line: 96, baseType: !102, size: 32, offset: 1536)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !98, file: !99, line: 98, baseType: !153, size: 160, offset: 1568)
!153 = !DICompositeType(tag: DW_TAG_array_type, baseType: !91, size: 160, elements: !154)
!154 = !{!155}
!155 = !DISubrange(count: 20)
!156 = !DIGlobalVariableExpression(var: !157, expr: !DIExpression())
!157 = distinct !DIGlobalVariable(name: "stdout", scope: !2, file: !94, line: 138, type: !95, isLocal: false, isDefinition: false)
!158 = !DIGlobalVariableExpression(var: !159, expr: !DIExpression())
!159 = distinct !DIGlobalVariable(name: "bpf_csum_diff", scope: !2, file: !160, line: 782, type: !161, isLocal: true, isDefinition: true)
!160 = !DIFile(filename: "../libbpf/src//build/usr/include/bpf/bpf_helper_defs.h", directory: "/home/rohit/cloned/New-IP/xdp/newip_router")
!161 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !162, size: 64)
!162 = !DISubroutineType(types: !163)
!163 = !{!164, !74, !71, !74, !71, !165}
!164 = !DIDerivedType(tag: DW_TAG_typedef, name: "__s64", file: !47, line: 30, baseType: !138)
!165 = !DIDerivedType(tag: DW_TAG_typedef, name: "__wsum", file: !65, line: 32, baseType: !71)
!166 = !DIGlobalVariableExpression(var: !167, expr: !DIExpression())
!167 = distinct !DIGlobalVariable(name: "bpf_redirect", scope: !2, file: !160, line: 607, type: !168, isLocal: true, isDefinition: true)
!168 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !169, size: 64)
!169 = !DISubroutineType(types: !170)
!170 = !{!45, !71, !171}
!171 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u64", file: !47, line: 31, baseType: !172)
!172 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!173 = !DIGlobalVariableExpression(var: !174, expr: !DIExpression())
!174 = distinct !DIGlobalVariable(name: "bpf_map_lookup_elem", scope: !2, file: !160, line: 49, type: !175, isLocal: true, isDefinition: true)
!175 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !176, size: 64)
!176 = !DISubroutineType(types: !177)
!177 = !{!44, !44, !178}
!178 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !179, size: 64)
!179 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!180 = !DIGlobalVariableExpression(var: !181, expr: !DIExpression())
!181 = distinct !DIGlobalVariable(name: "bpf_redirect_map", scope: !2, file: !160, line: 1286, type: !182, isLocal: true, isDefinition: true)
!182 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !183, size: 64)
!183 = !DISubroutineType(types: !184)
!184 = !{!45, !44, !71, !171}
!185 = !DIGlobalVariableExpression(var: !186, expr: !DIExpression())
!186 = distinct !DIGlobalVariable(name: "bpf_trace_printk", scope: !2, file: !160, line: 170, type: !187, isLocal: true, isDefinition: true)
!187 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !188, size: 64)
!188 = !DISubroutineType(types: !189)
!189 = !{!45, !190, !71, null}
!190 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !191, size: 64)
!191 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !91)
!192 = !DIGlobalVariableExpression(var: !193, expr: !DIExpression())
!193 = distinct !DIGlobalVariable(name: "bpf_fib_lookup", scope: !2, file: !160, line: 1803, type: !194, isLocal: true, isDefinition: true)
!194 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !195, size: 64)
!195 = !DISubroutineType(types: !196)
!196 = !{!45, !44, !197, !102, !71}
!197 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !198, size: 64)
!198 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bpf_fib_lookup", file: !6, line: 3179, size: 512, elements: !199)
!199 = !{!200, !201, !202, !203, !204, !205, !206, !212, !218, !223, !224, !225, !229}
!200 = !DIDerivedType(tag: DW_TAG_member, name: "family", scope: !198, file: !6, line: 3183, baseType: !58, size: 8)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "l4_protocol", scope: !198, file: !6, line: 3186, baseType: !58, size: 8, offset: 8)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "sport", scope: !198, file: !6, line: 3187, baseType: !64, size: 16, offset: 16)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "dport", scope: !198, file: !6, line: 3188, baseType: !64, size: 16, offset: 32)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "tot_len", scope: !198, file: !6, line: 3191, baseType: !46, size: 16, offset: 48)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "ifindex", scope: !198, file: !6, line: 3196, baseType: !71, size: 32, offset: 64)
!206 = !DIDerivedType(tag: DW_TAG_member, scope: !198, file: !6, line: 3198, baseType: !207, size: 32, offset: 96)
!207 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !198, file: !6, line: 3198, size: 32, elements: !208)
!208 = !{!209, !210, !211}
!209 = !DIDerivedType(tag: DW_TAG_member, name: "tos", scope: !207, file: !6, line: 3200, baseType: !58, size: 8)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "flowinfo", scope: !207, file: !6, line: 3201, baseType: !70, size: 32)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "rt_metric", scope: !207, file: !6, line: 3204, baseType: !71, size: 32)
!212 = !DIDerivedType(tag: DW_TAG_member, scope: !198, file: !6, line: 3207, baseType: !213, size: 128, offset: 128)
!213 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !198, file: !6, line: 3207, size: 128, elements: !214)
!214 = !{!215, !216}
!215 = !DIDerivedType(tag: DW_TAG_member, name: "ipv4_src", scope: !213, file: !6, line: 3208, baseType: !70, size: 32)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "ipv6_src", scope: !213, file: !6, line: 3209, baseType: !217, size: 128)
!217 = !DICompositeType(tag: DW_TAG_array_type, baseType: !71, size: 128, elements: !72)
!218 = !DIDerivedType(tag: DW_TAG_member, scope: !198, file: !6, line: 3216, baseType: !219, size: 128, offset: 256)
!219 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !198, file: !6, line: 3216, size: 128, elements: !220)
!220 = !{!221, !222}
!221 = !DIDerivedType(tag: DW_TAG_member, name: "ipv4_dst", scope: !219, file: !6, line: 3217, baseType: !70, size: 32)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "ipv6_dst", scope: !219, file: !6, line: 3218, baseType: !217, size: 128)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "h_vlan_proto", scope: !198, file: !6, line: 3222, baseType: !64, size: 16, offset: 384)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "h_vlan_TCI", scope: !198, file: !6, line: 3223, baseType: !64, size: 16, offset: 400)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "smac", scope: !198, file: !6, line: 3224, baseType: !226, size: 48, offset: 416)
!226 = !DICompositeType(tag: DW_TAG_array_type, baseType: !58, size: 48, elements: !227)
!227 = !{!228}
!228 = !DISubrange(count: 6)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "dmac", scope: !198, file: !6, line: 3225, baseType: !226, size: 48, offset: 464)
!230 = !DIFile(filename: "./../common/xdp_stats_kern.h", directory: "/home/rohit/cloned/New-IP/xdp/newip_router")
!231 = !{i32 7, !"Dwarf Version", i32 4}
!232 = !{i32 2, !"Debug Info Version", i32 3}
!233 = !{i32 1, !"wchar_size", i32 4}
!234 = !{!"clang version 10.0.0-4ubuntu1 "}
!235 = distinct !DISubprogram(name: "xdp_icmp_echo_func", scope: !3, file: !3, line: 64, type: !236, scopeLine: 65, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !246)
!236 = !DISubroutineType(types: !237)
!237 = !{!102, !238}
!238 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !239, size: 64)
!239 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "xdp_md", file: !6, line: 2856, size: 160, elements: !240)
!240 = !{!241, !242, !243, !244, !245}
!241 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !239, file: !6, line: 2857, baseType: !71, size: 32)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "data_end", scope: !239, file: !6, line: 2858, baseType: !71, size: 32, offset: 32)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "data_meta", scope: !239, file: !6, line: 2859, baseType: !71, size: 32, offset: 64)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "ingress_ifindex", scope: !239, file: !6, line: 2861, baseType: !71, size: 32, offset: 96)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "rx_queue_index", scope: !239, file: !6, line: 2862, baseType: !71, size: 32, offset: 128)
!246 = !{!247, !248, !249, !250, !255, !264, !265, !266, !267, !284, !300, !301, !302, !309, !310, !311}
!247 = !DILocalVariable(name: "ctx", arg: 1, scope: !235, file: !3, line: 64, type: !238)
!248 = !DILocalVariable(name: "data_end", scope: !235, file: !3, line: 66, type: !44)
!249 = !DILocalVariable(name: "data", scope: !235, file: !3, line: 67, type: !44)
!250 = !DILocalVariable(name: "nh", scope: !235, file: !3, line: 68, type: !251)
!251 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hdr_cursor", file: !252, line: 33, size: 64, elements: !253)
!252 = !DIFile(filename: "./../common/parsing_helpers.h", directory: "/home/rohit/cloned/New-IP/xdp/newip_router")
!253 = !{!254}
!254 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !251, file: !252, line: 34, baseType: !44, size: 64)
!255 = !DILocalVariable(name: "eth", scope: !235, file: !3, line: 69, type: !256)
!256 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !257, size: 64)
!257 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ethhdr", file: !258, line: 163, size: 112, elements: !259)
!258 = !DIFile(filename: "/usr/include/linux/if_ether.h", directory: "")
!259 = !{!260, !262, !263}
!260 = !DIDerivedType(tag: DW_TAG_member, name: "h_dest", scope: !257, file: !258, line: 164, baseType: !261, size: 48)
!261 = !DICompositeType(tag: DW_TAG_array_type, baseType: !59, size: 48, elements: !227)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "h_source", scope: !257, file: !258, line: 165, baseType: !261, size: 48, offset: 48)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "h_proto", scope: !257, file: !258, line: 166, baseType: !64, size: 16, offset: 96)
!264 = !DILocalVariable(name: "eth_type", scope: !235, file: !3, line: 70, type: !102)
!265 = !DILocalVariable(name: "ip_type", scope: !235, file: !3, line: 71, type: !102)
!266 = !DILocalVariable(name: "icmp_type", scope: !235, file: !3, line: 72, type: !102)
!267 = !DILocalVariable(name: "iphdr", scope: !235, file: !3, line: 73, type: !268)
!268 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !269, size: 64)
!269 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "iphdr", file: !270, line: 86, size: 160, elements: !271)
!270 = !DIFile(filename: "/usr/include/linux/ip.h", directory: "")
!271 = !{!272, !273, !274, !275, !276, !277, !278, !279, !280, !282, !283}
!272 = !DIDerivedType(tag: DW_TAG_member, name: "ihl", scope: !269, file: !270, line: 88, baseType: !58, size: 4, flags: DIFlagBitField, extraData: i64 0)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !269, file: !270, line: 89, baseType: !58, size: 4, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "tos", scope: !269, file: !270, line: 96, baseType: !58, size: 8, offset: 8)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "tot_len", scope: !269, file: !270, line: 97, baseType: !64, size: 16, offset: 16)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !269, file: !270, line: 98, baseType: !64, size: 16, offset: 32)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "frag_off", scope: !269, file: !270, line: 99, baseType: !64, size: 16, offset: 48)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "ttl", scope: !269, file: !270, line: 100, baseType: !58, size: 8, offset: 64)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "protocol", scope: !269, file: !270, line: 101, baseType: !58, size: 8, offset: 72)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "check", scope: !269, file: !270, line: 102, baseType: !281, size: 16, offset: 80)
!281 = !DIDerivedType(tag: DW_TAG_typedef, name: "__sum16", file: !65, line: 31, baseType: !46)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "saddr", scope: !269, file: !270, line: 103, baseType: !70, size: 32, offset: 96)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "daddr", scope: !269, file: !270, line: 104, baseType: !70, size: 32, offset: 128)
!284 = !DILocalVariable(name: "ipv6hdr", scope: !235, file: !3, line: 74, type: !285)
!285 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !286, size: 64)
!286 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ipv6hdr", file: !287, line: 116, size: 320, elements: !288)
!287 = !DIFile(filename: "/usr/include/linux/ipv6.h", directory: "")
!288 = !{!289, !290, !291, !295, !296, !297, !298, !299}
!289 = !DIDerivedType(tag: DW_TAG_member, name: "priority", scope: !286, file: !287, line: 118, baseType: !58, size: 4, flags: DIFlagBitField, extraData: i64 0)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !286, file: !287, line: 119, baseType: !58, size: 4, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "flow_lbl", scope: !286, file: !287, line: 126, baseType: !292, size: 24, offset: 8)
!292 = !DICompositeType(tag: DW_TAG_array_type, baseType: !58, size: 24, elements: !293)
!293 = !{!294}
!294 = !DISubrange(count: 3)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "payload_len", scope: !286, file: !287, line: 128, baseType: !64, size: 16, offset: 32)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "nexthdr", scope: !286, file: !287, line: 129, baseType: !58, size: 8, offset: 48)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "hop_limit", scope: !286, file: !287, line: 130, baseType: !58, size: 8, offset: 56)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "saddr", scope: !286, file: !287, line: 132, baseType: !50, size: 128, offset: 64)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "daddr", scope: !286, file: !287, line: 133, baseType: !50, size: 128, offset: 192)
!300 = !DILocalVariable(name: "echo_reply", scope: !235, file: !3, line: 75, type: !46)
!301 = !DILocalVariable(name: "old_csum", scope: !235, file: !3, line: 75, type: !46)
!302 = !DILocalVariable(name: "icmphdr", scope: !235, file: !3, line: 76, type: !303)
!303 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !304, size: 64)
!304 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "icmphdr_common", file: !252, line: 51, size: 32, elements: !305)
!305 = !{!306, !307, !308}
!306 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !304, file: !252, line: 52, baseType: !58, size: 8)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !304, file: !252, line: 53, baseType: !58, size: 8, offset: 8)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "cksum", scope: !304, file: !252, line: 54, baseType: !281, size: 16, offset: 16)
!309 = !DILocalVariable(name: "icmphdr_old", scope: !235, file: !3, line: 77, type: !304)
!310 = !DILocalVariable(name: "action", scope: !235, file: !3, line: 78, type: !71)
!311 = !DILabel(scope: !235, name: "out", file: !3, line: 159)
!312 = !DILocalVariable(name: "tmp", scope: !313, file: !314, line: 127, type: !50)
!313 = distinct !DISubprogram(name: "swap_src_dst_ipv6", scope: !314, file: !314, line: 125, type: !315, scopeLine: 126, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !317)
!314 = !DIFile(filename: "./../common/rewrite_helpers.h", directory: "/home/rohit/cloned/New-IP/xdp/newip_router")
!315 = !DISubroutineType(types: !316)
!316 = !{null, !285}
!317 = !{!318, !312}
!318 = !DILocalVariable(name: "ipv6", arg: 1, scope: !313, file: !314, line: 125, type: !285)
!319 = !DILocation(line: 127, column: 18, scope: !313, inlinedAt: !320)
!320 = distinct !DILocation(line: 118, column: 3, scope: !321)
!321 = distinct !DILexicalBlock(scope: !322, file: !3, line: 116, column: 2)
!322 = distinct !DILexicalBlock(scope: !323, file: !3, line: 115, column: 11)
!323 = distinct !DILexicalBlock(scope: !235, file: !3, line: 109, column: 6)
!324 = !DILocalVariable(name: "h_tmp", scope: !325, file: !314, line: 115, type: !226)
!325 = distinct !DISubprogram(name: "swap_src_dst_mac", scope: !314, file: !314, line: 113, type: !326, scopeLine: 114, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !328)
!326 = !DISubroutineType(types: !327)
!327 = !{null, !256}
!328 = !{!329, !324}
!329 = !DILocalVariable(name: "eth", arg: 1, scope: !325, file: !314, line: 113, type: !256)
!330 = !DILocation(line: 115, column: 7, scope: !325, inlinedAt: !331)
!331 = distinct !DILocation(line: 127, column: 2, scope: !235)
!332 = !DILocation(line: 0, scope: !235)
!333 = !DILocation(line: 66, column: 38, scope: !235)
!334 = !{!335, !336, i64 4}
!335 = !{!"xdp_md", !336, i64 0, !336, i64 4, !336, i64 8, !336, i64 12, !336, i64 16}
!336 = !{!"int", !337, i64 0}
!337 = !{!"omnipotent char", !338, i64 0}
!338 = !{!"Simple C/C++ TBAA"}
!339 = !DILocation(line: 66, column: 27, scope: !235)
!340 = !DILocation(line: 66, column: 19, scope: !235)
!341 = !DILocation(line: 67, column: 34, scope: !235)
!342 = !{!335, !336, i64 0}
!343 = !DILocation(line: 67, column: 23, scope: !235)
!344 = !DILocation(line: 67, column: 15, scope: !235)
!345 = !DILocation(line: 77, column: 2, scope: !235)
!346 = !DILocalVariable(name: "nh", arg: 1, scope: !347, file: !252, line: 124, type: !350)
!347 = distinct !DISubprogram(name: "parse_ethhdr", scope: !252, file: !252, line: 124, type: !348, scopeLine: 127, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !352)
!348 = !DISubroutineType(types: !349)
!349 = !{!102, !350, !44, !351}
!350 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !251, size: 64)
!351 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !256, size: 64)
!352 = !{!346, !353, !354}
!353 = !DILocalVariable(name: "data_end", arg: 2, scope: !347, file: !252, line: 125, type: !44)
!354 = !DILocalVariable(name: "ethhdr", arg: 3, scope: !347, file: !252, line: 126, type: !351)
!355 = !DILocation(line: 0, scope: !347, inlinedAt: !356)
!356 = distinct !DILocation(line: 84, column: 13, scope: !235)
!357 = !DILocalVariable(name: "nh", arg: 1, scope: !358, file: !252, line: 79, type: !350)
!358 = distinct !DISubprogram(name: "parse_ethhdr_vlan", scope: !252, file: !252, line: 79, type: !359, scopeLine: 83, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !368)
!359 = !DISubroutineType(types: !360)
!360 = !{!102, !350, !44, !351, !361}
!361 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !362, size: 64)
!362 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "collect_vlans", file: !252, line: 64, size: 32, elements: !363)
!363 = !{!364}
!364 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !362, file: !252, line: 65, baseType: !365, size: 32)
!365 = !DICompositeType(tag: DW_TAG_array_type, baseType: !46, size: 32, elements: !366)
!366 = !{!367}
!367 = !DISubrange(count: 2)
!368 = !{!357, !369, !370, !371, !372, !373, !374, !380, !381}
!369 = !DILocalVariable(name: "data_end", arg: 2, scope: !358, file: !252, line: 80, type: !44)
!370 = !DILocalVariable(name: "ethhdr", arg: 3, scope: !358, file: !252, line: 81, type: !351)
!371 = !DILocalVariable(name: "vlans", arg: 4, scope: !358, file: !252, line: 82, type: !361)
!372 = !DILocalVariable(name: "eth", scope: !358, file: !252, line: 84, type: !256)
!373 = !DILocalVariable(name: "hdrsize", scope: !358, file: !252, line: 85, type: !102)
!374 = !DILocalVariable(name: "vlh", scope: !358, file: !252, line: 86, type: !375)
!375 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !376, size: 64)
!376 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "vlan_hdr", file: !252, line: 42, size: 32, elements: !377)
!377 = !{!378, !379}
!378 = !DIDerivedType(tag: DW_TAG_member, name: "h_vlan_TCI", scope: !376, file: !252, line: 43, baseType: !64, size: 16)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "h_vlan_encapsulated_proto", scope: !376, file: !252, line: 44, baseType: !64, size: 16, offset: 16)
!380 = !DILocalVariable(name: "h_proto", scope: !358, file: !252, line: 87, type: !46)
!381 = !DILocalVariable(name: "i", scope: !358, file: !252, line: 88, type: !102)
!382 = !DILocation(line: 0, scope: !358, inlinedAt: !383)
!383 = distinct !DILocation(line: 129, column: 9, scope: !347, inlinedAt: !356)
!384 = !DILocation(line: 93, column: 14, scope: !385, inlinedAt: !383)
!385 = distinct !DILexicalBlock(scope: !358, file: !252, line: 93, column: 6)
!386 = !DILocation(line: 93, column: 24, scope: !385, inlinedAt: !383)
!387 = !DILocation(line: 93, column: 6, scope: !358, inlinedAt: !383)
!388 = !DILocation(line: 97, column: 10, scope: !358, inlinedAt: !383)
!389 = !DILocation(line: 99, column: 17, scope: !358, inlinedAt: !383)
!390 = !{!391, !391, i64 0}
!391 = !{!"short", !337, i64 0}
!392 = !DILocation(line: 0, scope: !393, inlinedAt: !383)
!393 = distinct !DILexicalBlock(scope: !394, file: !252, line: 109, column: 7)
!394 = distinct !DILexicalBlock(scope: !395, file: !252, line: 105, column: 39)
!395 = distinct !DILexicalBlock(scope: !396, file: !252, line: 105, column: 2)
!396 = distinct !DILexicalBlock(scope: !358, file: !252, line: 105, column: 2)
!397 = !DILocation(line: 105, column: 2, scope: !396, inlinedAt: !383)
!398 = !DILocation(line: 106, column: 7, scope: !394, inlinedAt: !383)
!399 = !DILocation(line: 109, column: 11, scope: !393, inlinedAt: !383)
!400 = !DILocation(line: 109, column: 15, scope: !393, inlinedAt: !383)
!401 = !DILocation(line: 109, column: 7, scope: !394, inlinedAt: !383)
!402 = !DILocation(line: 112, column: 18, scope: !394, inlinedAt: !383)
!403 = !DILocation(line: 85, column: 6, scope: !235)
!404 = !DILocalVariable(name: "nh", arg: 1, scope: !405, file: !252, line: 151, type: !350)
!405 = distinct !DISubprogram(name: "parse_iphdr", scope: !252, file: !252, line: 151, type: !406, scopeLine: 154, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !409)
!406 = !DISubroutineType(types: !407)
!407 = !{!102, !350, !44, !408}
!408 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !268, size: 64)
!409 = !{!404, !410, !411, !412, !413}
!410 = !DILocalVariable(name: "data_end", arg: 2, scope: !405, file: !252, line: 152, type: !44)
!411 = !DILocalVariable(name: "iphdr", arg: 3, scope: !405, file: !252, line: 153, type: !408)
!412 = !DILocalVariable(name: "iph", scope: !405, file: !252, line: 155, type: !268)
!413 = !DILocalVariable(name: "hdrsize", scope: !405, file: !252, line: 156, type: !102)
!414 = !DILocation(line: 0, scope: !405, inlinedAt: !415)
!415 = distinct !DILocation(line: 87, column: 13, scope: !416)
!416 = distinct !DILexicalBlock(scope: !417, file: !3, line: 86, column: 2)
!417 = distinct !DILexicalBlock(scope: !235, file: !3, line: 85, column: 6)
!418 = !DILocation(line: 158, column: 10, scope: !419, inlinedAt: !415)
!419 = distinct !DILexicalBlock(scope: !405, file: !252, line: 158, column: 6)
!420 = !DILocation(line: 158, column: 14, scope: !419, inlinedAt: !415)
!421 = !DILocation(line: 158, column: 6, scope: !405, inlinedAt: !415)
!422 = !DILocation(line: 161, column: 17, scope: !405, inlinedAt: !415)
!423 = !DILocation(line: 161, column: 21, scope: !405, inlinedAt: !415)
!424 = !DILocation(line: 163, column: 13, scope: !425, inlinedAt: !415)
!425 = distinct !DILexicalBlock(scope: !405, file: !252, line: 163, column: 5)
!426 = !DILocation(line: 163, column: 5, scope: !405, inlinedAt: !415)
!427 = !DILocation(line: 163, column: 5, scope: !425, inlinedAt: !415)
!428 = !DILocation(line: 167, column: 14, scope: !429, inlinedAt: !415)
!429 = distinct !DILexicalBlock(scope: !405, file: !252, line: 167, column: 6)
!430 = !DILocation(line: 167, column: 24, scope: !429, inlinedAt: !415)
!431 = !DILocation(line: 167, column: 6, scope: !405, inlinedAt: !415)
!432 = !DILocation(line: 171, column: 9, scope: !405, inlinedAt: !415)
!433 = !DILocation(line: 173, column: 14, scope: !405, inlinedAt: !415)
!434 = !{!435, !337, i64 9}
!435 = !{!"iphdr", !337, i64 0, !337, i64 0, !337, i64 1, !391, i64 2, !391, i64 4, !391, i64 6, !337, i64 8, !337, i64 9, !391, i64 10, !336, i64 12, !336, i64 16}
!436 = !DILocation(line: 88, column: 15, scope: !437)
!437 = distinct !DILexicalBlock(scope: !416, file: !3, line: 88, column: 7)
!438 = !DILocation(line: 88, column: 7, scope: !416)
!439 = !DILocalVariable(name: "nh", arg: 1, scope: !440, file: !252, line: 132, type: !350)
!440 = distinct !DISubprogram(name: "parse_ip6hdr", scope: !252, file: !252, line: 132, type: !441, scopeLine: 135, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !444)
!441 = !DISubroutineType(types: !442)
!442 = !{!102, !350, !44, !443}
!443 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !285, size: 64)
!444 = !{!439, !445, !446, !447}
!445 = !DILocalVariable(name: "data_end", arg: 2, scope: !440, file: !252, line: 133, type: !44)
!446 = !DILocalVariable(name: "ip6hdr", arg: 3, scope: !440, file: !252, line: 134, type: !443)
!447 = !DILocalVariable(name: "ip6h", scope: !440, file: !252, line: 136, type: !285)
!448 = !DILocation(line: 0, scope: !440, inlinedAt: !449)
!449 = distinct !DILocation(line: 93, column: 13, scope: !450)
!450 = distinct !DILexicalBlock(scope: !451, file: !3, line: 92, column: 2)
!451 = distinct !DILexicalBlock(scope: !417, file: !3, line: 91, column: 11)
!452 = !DILocation(line: 142, column: 11, scope: !453, inlinedAt: !449)
!453 = distinct !DILexicalBlock(scope: !440, file: !252, line: 142, column: 6)
!454 = !DILocation(line: 142, column: 17, scope: !453, inlinedAt: !449)
!455 = !DILocation(line: 142, column: 15, scope: !453, inlinedAt: !449)
!456 = !DILocation(line: 142, column: 6, scope: !440, inlinedAt: !449)
!457 = !DILocation(line: 136, column: 29, scope: !440, inlinedAt: !449)
!458 = !DILocation(line: 148, column: 15, scope: !440, inlinedAt: !449)
!459 = !{!460, !337, i64 6}
!460 = !{!"ipv6hdr", !337, i64 0, !337, i64 0, !337, i64 1, !391, i64 4, !337, i64 6, !337, i64 7, !461, i64 8, !461, i64 24}
!461 = !{!"in6_addr", !337, i64 0}
!462 = !DILocation(line: 94, column: 15, scope: !463)
!463 = distinct !DILexicalBlock(scope: !450, file: !3, line: 94, column: 7)
!464 = !DILocation(line: 94, column: 7, scope: !450)
!465 = !DILocation(line: 81, column: 9, scope: !235)
!466 = !DILocalVariable(name: "nh", arg: 1, scope: !467, file: !252, line: 206, type: !350)
!467 = distinct !DISubprogram(name: "parse_icmphdr_common", scope: !252, file: !252, line: 206, type: !468, scopeLine: 209, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !471)
!468 = !DISubroutineType(types: !469)
!469 = !{!102, !350, !44, !470}
!470 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !303, size: 64)
!471 = !{!466, !472, !473, !474}
!472 = !DILocalVariable(name: "data_end", arg: 2, scope: !467, file: !252, line: 207, type: !44)
!473 = !DILocalVariable(name: "icmphdr", arg: 3, scope: !467, file: !252, line: 208, type: !470)
!474 = !DILocalVariable(name: "h", scope: !467, file: !252, line: 210, type: !303)
!475 = !DILocation(line: 0, scope: !467, inlinedAt: !476)
!476 = distinct !DILocation(line: 108, column: 14, scope: !235)
!477 = !DILocation(line: 212, column: 8, scope: !478, inlinedAt: !476)
!478 = distinct !DILexicalBlock(scope: !467, file: !252, line: 212, column: 6)
!479 = !DILocation(line: 212, column: 14, scope: !478, inlinedAt: !476)
!480 = !DILocation(line: 212, column: 12, scope: !478, inlinedAt: !476)
!481 = !DILocation(line: 212, column: 6, scope: !467, inlinedAt: !476)
!482 = !DILocation(line: 218, column: 12, scope: !467, inlinedAt: !476)
!483 = !{!484, !337, i64 0}
!484 = !{!"icmphdr_common", !337, i64 0, !337, i64 1, !391, i64 2}
!485 = !DILocation(line: 109, column: 51, scope: !323)
!486 = !DILocation(line: 109, column: 38, scope: !323)
!487 = !DILocalVariable(name: "iphdr", arg: 1, scope: !488, file: !314, line: 136, type: !268)
!488 = distinct !DISubprogram(name: "swap_src_dst_ipv4", scope: !314, file: !314, line: 136, type: !489, scopeLine: 137, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !491)
!489 = !DISubroutineType(types: !490)
!490 = !{null, !268}
!491 = !{!487, !492}
!492 = !DILocalVariable(name: "tmp", scope: !488, file: !314, line: 138, type: !70)
!493 = !DILocation(line: 0, scope: !488, inlinedAt: !494)
!494 = distinct !DILocation(line: 112, column: 3, scope: !495)
!495 = distinct !DILexicalBlock(scope: !323, file: !3, line: 110, column: 2)
!496 = !DILocation(line: 138, column: 22, scope: !488, inlinedAt: !494)
!497 = !{!435, !336, i64 12}
!498 = !DILocation(line: 140, column: 24, scope: !488, inlinedAt: !494)
!499 = !{!435, !336, i64 16}
!500 = !DILocation(line: 140, column: 15, scope: !488, inlinedAt: !494)
!501 = !DILocation(line: 141, column: 15, scope: !488, inlinedAt: !494)
!502 = !DILocation(line: 114, column: 2, scope: !495)
!503 = !DILocation(line: 115, column: 20, scope: !322)
!504 = !DILocation(line: 115, column: 58, scope: !322)
!505 = !DILocation(line: 115, column: 45, scope: !322)
!506 = !DILocation(line: 0, scope: !313, inlinedAt: !320)
!507 = !DILocation(line: 127, column: 2, scope: !313, inlinedAt: !320)
!508 = !DILocation(line: 127, column: 30, scope: !313, inlinedAt: !320)
!509 = !{i64 0, i64 16, !510, i64 0, i64 16, !510, i64 0, i64 16, !510}
!510 = !{!337, !337, i64 0}
!511 = !DILocation(line: 129, column: 22, scope: !313, inlinedAt: !320)
!512 = !DILocation(line: 130, column: 16, scope: !313, inlinedAt: !320)
!513 = !DILocation(line: 131, column: 1, scope: !313, inlinedAt: !320)
!514 = !DILocation(line: 0, scope: !325, inlinedAt: !331)
!515 = !DILocation(line: 115, column: 2, scope: !325, inlinedAt: !331)
!516 = !DILocation(line: 117, column: 2, scope: !325, inlinedAt: !331)
!517 = !DILocation(line: 118, column: 2, scope: !325, inlinedAt: !331)
!518 = !DILocation(line: 119, column: 2, scope: !325, inlinedAt: !331)
!519 = !DILocation(line: 120, column: 1, scope: !325, inlinedAt: !331)
!520 = !DILocation(line: 130, column: 22, scope: !235)
!521 = !{!484, !391, i64 2}
!522 = !DILocation(line: 131, column: 17, scope: !235)
!523 = !DILocation(line: 132, column: 17, scope: !235)
!524 = !DILocation(line: 132, column: 16, scope: !235)
!525 = !DILocation(line: 133, column: 16, scope: !235)
!526 = !DILocation(line: 134, column: 38, scope: !235)
!527 = !DILocalVariable(name: "seed", arg: 1, scope: !528, file: !3, line: 52, type: !46)
!528 = distinct !DISubprogram(name: "icmp_checksum_diff", scope: !3, file: !3, line: 51, type: !529, scopeLine: 55, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !531)
!529 = !DISubroutineType(types: !530)
!530 = !{!46, !46, !303, !303}
!531 = !{!527, !532, !533, !534, !535}
!532 = !DILocalVariable(name: "icmphdr_new", arg: 2, scope: !528, file: !3, line: 53, type: !303)
!533 = !DILocalVariable(name: "icmphdr_old", arg: 3, scope: !528, file: !3, line: 54, type: !303)
!534 = !DILocalVariable(name: "csum", scope: !528, file: !3, line: 56, type: !71)
!535 = !DILocalVariable(name: "size", scope: !528, file: !3, line: 56, type: !71)
!536 = !DILocation(line: 0, scope: !528, inlinedAt: !537)
!537 = distinct !DILocation(line: 134, column: 19, scope: !235)
!538 = !DILocation(line: 58, column: 81, scope: !528, inlinedAt: !537)
!539 = !DILocation(line: 58, column: 9, scope: !528, inlinedAt: !537)
!540 = !DILocalVariable(name: "csum", arg: 1, scope: !541, file: !3, line: 36, type: !71)
!541 = distinct !DISubprogram(name: "csum_fold_helper", scope: !3, file: !3, line: 36, type: !542, scopeLine: 37, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !544)
!542 = !DISubroutineType(types: !543)
!543 = !{!46, !71}
!544 = !{!540, !545}
!545 = !DILocalVariable(name: "sum", scope: !541, file: !3, line: 38, type: !71)
!546 = !DILocation(line: 0, scope: !541, inlinedAt: !547)
!547 = distinct !DILocation(line: 59, column: 9, scope: !528, inlinedAt: !537)
!548 = !DILocation(line: 39, column: 14, scope: !541, inlinedAt: !547)
!549 = !DILocation(line: 39, column: 29, scope: !541, inlinedAt: !547)
!550 = !DILocation(line: 39, column: 21, scope: !541, inlinedAt: !547)
!551 = !DILocation(line: 40, column: 14, scope: !541, inlinedAt: !547)
!552 = !DILocation(line: 40, column: 6, scope: !541, inlinedAt: !547)
!553 = !DILocation(line: 41, column: 9, scope: !541, inlinedAt: !547)
!554 = !DILocation(line: 134, column: 17, scope: !235)
!555 = !DILocation(line: 157, column: 2, scope: !235)
!556 = !DILocation(line: 159, column: 1, scope: !235)
!557 = !DILocation(line: 0, scope: !558, inlinedAt: !571)
!558 = distinct !DISubprogram(name: "xdp_stats_record_action", scope: !230, file: !230, line: 24, type: !559, scopeLine: 25, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !561)
!559 = !DISubroutineType(types: !560)
!560 = !{!71, !238, !71}
!561 = !{!562, !563, !564}
!562 = !DILocalVariable(name: "ctx", arg: 1, scope: !558, file: !230, line: 24, type: !238)
!563 = !DILocalVariable(name: "action", arg: 2, scope: !558, file: !230, line: 24, type: !71)
!564 = !DILocalVariable(name: "rec", scope: !558, file: !230, line: 30, type: !565)
!565 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !566, size: 64)
!566 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "datarec", file: !567, line: 10, size: 128, elements: !568)
!567 = !DIFile(filename: "./../common/xdp_stats_kern_user.h", directory: "/home/rohit/cloned/New-IP/xdp/newip_router")
!568 = !{!569, !570}
!569 = !DIDerivedType(tag: DW_TAG_member, name: "rx_packets", scope: !566, file: !567, line: 11, baseType: !171, size: 64)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "rx_bytes", scope: !566, file: !567, line: 12, baseType: !171, size: 64, offset: 64)
!571 = distinct !DILocation(line: 160, column: 9, scope: !235)
!572 = !{!336, !336, i64 0}
!573 = !DILocation(line: 30, column: 24, scope: !558, inlinedAt: !571)
!574 = !DILocation(line: 31, column: 7, scope: !575, inlinedAt: !571)
!575 = distinct !DILexicalBlock(scope: !558, file: !230, line: 31, column: 6)
!576 = !DILocation(line: 31, column: 6, scope: !558, inlinedAt: !571)
!577 = !DILocation(line: 38, column: 7, scope: !558, inlinedAt: !571)
!578 = !DILocation(line: 38, column: 17, scope: !558, inlinedAt: !571)
!579 = !{!580, !581, i64 0}
!580 = !{!"datarec", !581, i64 0, !581, i64 8}
!581 = !{!"long long", !337, i64 0}
!582 = !DILocation(line: 39, column: 25, scope: !558, inlinedAt: !571)
!583 = !DILocation(line: 39, column: 41, scope: !558, inlinedAt: !571)
!584 = !DILocation(line: 39, column: 34, scope: !558, inlinedAt: !571)
!585 = !DILocation(line: 39, column: 19, scope: !558, inlinedAt: !571)
!586 = !DILocation(line: 39, column: 7, scope: !558, inlinedAt: !571)
!587 = !DILocation(line: 39, column: 16, scope: !558, inlinedAt: !571)
!588 = !{!580, !581, i64 8}
!589 = !DILocation(line: 41, column: 9, scope: !558, inlinedAt: !571)
!590 = !DILocation(line: 41, column: 2, scope: !558, inlinedAt: !571)
!591 = !DILocation(line: 42, column: 1, scope: !558, inlinedAt: !571)
!592 = !DILocation(line: 161, column: 1, scope: !235)
!593 = !DILocation(line: 160, column: 2, scope: !235)
!594 = distinct !DISubprogram(name: "xdp_redirect_func", scope: !3, file: !3, line: 165, type: !236, scopeLine: 166, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !595)
!595 = !{!596, !597, !598, !599, !600, !601, !602, !603, !604, !605}
!596 = !DILocalVariable(name: "ctx", arg: 1, scope: !594, file: !3, line: 165, type: !238)
!597 = !DILocalVariable(name: "data_end", scope: !594, file: !3, line: 167, type: !44)
!598 = !DILocalVariable(name: "data", scope: !594, file: !3, line: 168, type: !44)
!599 = !DILocalVariable(name: "nh", scope: !594, file: !3, line: 169, type: !251)
!600 = !DILocalVariable(name: "eth", scope: !594, file: !3, line: 170, type: !256)
!601 = !DILocalVariable(name: "eth_type", scope: !594, file: !3, line: 171, type: !102)
!602 = !DILocalVariable(name: "action", scope: !594, file: !3, line: 172, type: !102)
!603 = !DILocalVariable(name: "dst", scope: !594, file: !3, line: 173, type: !261)
!604 = !DILocalVariable(name: "ifindex", scope: !594, file: !3, line: 174, type: !7)
!605 = !DILabel(scope: !594, name: "out", file: !3, line: 188)
!606 = !DILocation(line: 0, scope: !594)
!607 = !DILocation(line: 167, column: 38, scope: !594)
!608 = !DILocation(line: 167, column: 27, scope: !594)
!609 = !DILocation(line: 167, column: 19, scope: !594)
!610 = !DILocation(line: 168, column: 34, scope: !594)
!611 = !DILocation(line: 168, column: 23, scope: !594)
!612 = !DILocation(line: 168, column: 15, scope: !594)
!613 = !DILocation(line: 173, column: 2, scope: !594)
!614 = !DILocation(line: 173, column: 16, scope: !594)
!615 = !DILocation(line: 0, scope: !347, inlinedAt: !616)
!616 = distinct !DILocation(line: 180, column: 13, scope: !594)
!617 = !DILocation(line: 0, scope: !358, inlinedAt: !618)
!618 = distinct !DILocation(line: 129, column: 9, scope: !347, inlinedAt: !616)
!619 = !DILocation(line: 93, column: 14, scope: !385, inlinedAt: !618)
!620 = !DILocation(line: 93, column: 24, scope: !385, inlinedAt: !618)
!621 = !DILocation(line: 93, column: 6, scope: !358, inlinedAt: !618)
!622 = !DILocation(line: 97, column: 10, scope: !358, inlinedAt: !618)
!623 = !DILocation(line: 185, column: 2, scope: !594)
!624 = !DILocation(line: 186, column: 11, scope: !594)
!625 = !DILocation(line: 188, column: 1, scope: !594)
!626 = !DILocation(line: 0, scope: !558, inlinedAt: !627)
!627 = distinct !DILocation(line: 189, column: 9, scope: !594)
!628 = !DILocation(line: 26, column: 13, scope: !629, inlinedAt: !627)
!629 = distinct !DILexicalBlock(scope: !558, file: !230, line: 26, column: 6)
!630 = !DILocation(line: 26, column: 6, scope: !558, inlinedAt: !627)
!631 = !DILocation(line: 30, column: 24, scope: !558, inlinedAt: !627)
!632 = !DILocation(line: 31, column: 7, scope: !575, inlinedAt: !627)
!633 = !DILocation(line: 31, column: 6, scope: !558, inlinedAt: !627)
!634 = !DILocation(line: 38, column: 7, scope: !558, inlinedAt: !627)
!635 = !DILocation(line: 38, column: 17, scope: !558, inlinedAt: !627)
!636 = !DILocation(line: 39, column: 25, scope: !558, inlinedAt: !627)
!637 = !DILocation(line: 39, column: 41, scope: !558, inlinedAt: !627)
!638 = !DILocation(line: 39, column: 34, scope: !558, inlinedAt: !627)
!639 = !DILocation(line: 39, column: 19, scope: !558, inlinedAt: !627)
!640 = !DILocation(line: 39, column: 7, scope: !558, inlinedAt: !627)
!641 = !DILocation(line: 39, column: 16, scope: !558, inlinedAt: !627)
!642 = !DILocation(line: 41, column: 9, scope: !558, inlinedAt: !627)
!643 = !DILocation(line: 41, column: 2, scope: !558, inlinedAt: !627)
!644 = !DILocation(line: 42, column: 1, scope: !558, inlinedAt: !627)
!645 = !DILocation(line: 190, column: 1, scope: !594)
!646 = !DILocation(line: 189, column: 2, scope: !594)
!647 = distinct !DISubprogram(name: "xdp_redirect_map_func", scope: !3, file: !3, line: 194, type: !236, scopeLine: 195, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !648)
!648 = !{!649, !650, !651, !652, !653, !654, !655, !656, !658}
!649 = !DILocalVariable(name: "ctx", arg: 1, scope: !647, file: !3, line: 194, type: !238)
!650 = !DILocalVariable(name: "data_end", scope: !647, file: !3, line: 196, type: !44)
!651 = !DILocalVariable(name: "data", scope: !647, file: !3, line: 197, type: !44)
!652 = !DILocalVariable(name: "nh", scope: !647, file: !3, line: 198, type: !251)
!653 = !DILocalVariable(name: "eth", scope: !647, file: !3, line: 199, type: !256)
!654 = !DILocalVariable(name: "eth_type", scope: !647, file: !3, line: 200, type: !102)
!655 = !DILocalVariable(name: "action", scope: !647, file: !3, line: 201, type: !102)
!656 = !DILocalVariable(name: "dst", scope: !647, file: !3, line: 202, type: !657)
!657 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !59, size: 64)
!658 = !DILabel(scope: !647, name: "out", file: !3, line: 221)
!659 = !DILocation(line: 0, scope: !647)
!660 = !DILocation(line: 196, column: 38, scope: !647)
!661 = !DILocation(line: 196, column: 27, scope: !647)
!662 = !DILocation(line: 196, column: 19, scope: !647)
!663 = !DILocation(line: 197, column: 34, scope: !647)
!664 = !DILocation(line: 197, column: 23, scope: !647)
!665 = !DILocation(line: 197, column: 15, scope: !647)
!666 = !DILocation(line: 0, scope: !347, inlinedAt: !667)
!667 = distinct !DILocation(line: 208, column: 13, scope: !647)
!668 = !DILocation(line: 0, scope: !358, inlinedAt: !669)
!669 = distinct !DILocation(line: 129, column: 9, scope: !347, inlinedAt: !667)
!670 = !DILocation(line: 93, column: 14, scope: !385, inlinedAt: !669)
!671 = !DILocation(line: 93, column: 24, scope: !385, inlinedAt: !669)
!672 = !DILocation(line: 93, column: 6, scope: !358, inlinedAt: !669)
!673 = !DILocation(line: 97, column: 10, scope: !358, inlinedAt: !669)
!674 = !DILocation(line: 213, column: 46, scope: !647)
!675 = !DILocation(line: 213, column: 8, scope: !647)
!676 = !DILocation(line: 214, column: 7, scope: !677)
!677 = distinct !DILexicalBlock(scope: !647, file: !3, line: 214, column: 6)
!678 = !DILocation(line: 214, column: 6, scope: !647)
!679 = !DILocation(line: 221, column: 1, scope: !647)
!680 = !DILocation(line: 0, scope: !558, inlinedAt: !681)
!681 = distinct !DILocation(line: 222, column: 9, scope: !647)
!682 = !DILocation(line: 26, column: 6, scope: !558, inlinedAt: !681)
!683 = !DILocation(line: 218, column: 2, scope: !647)
!684 = !DILocation(line: 219, column: 11, scope: !647)
!685 = !DILocation(line: 26, column: 13, scope: !629, inlinedAt: !681)
!686 = !DILocation(line: 30, column: 24, scope: !558, inlinedAt: !681)
!687 = !DILocation(line: 31, column: 7, scope: !575, inlinedAt: !681)
!688 = !DILocation(line: 31, column: 6, scope: !558, inlinedAt: !681)
!689 = !DILocation(line: 38, column: 7, scope: !558, inlinedAt: !681)
!690 = !DILocation(line: 38, column: 17, scope: !558, inlinedAt: !681)
!691 = !DILocation(line: 39, column: 25, scope: !558, inlinedAt: !681)
!692 = !DILocation(line: 39, column: 41, scope: !558, inlinedAt: !681)
!693 = !DILocation(line: 39, column: 34, scope: !558, inlinedAt: !681)
!694 = !DILocation(line: 39, column: 19, scope: !558, inlinedAt: !681)
!695 = !DILocation(line: 39, column: 7, scope: !558, inlinedAt: !681)
!696 = !DILocation(line: 39, column: 16, scope: !558, inlinedAt: !681)
!697 = !DILocation(line: 41, column: 9, scope: !558, inlinedAt: !681)
!698 = !DILocation(line: 41, column: 2, scope: !558, inlinedAt: !681)
!699 = !DILocation(line: 42, column: 1, scope: !558, inlinedAt: !681)
!700 = !DILocation(line: 222, column: 2, scope: !647)
!701 = distinct !DISubprogram(name: "xdp_router_func", scope: !3, file: !3, line: 242, type: !236, scopeLine: 243, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !702)
!702 = !{!703, !704, !705, !706, !707, !708, !709, !710, !721, !722, !723, !724, !725, !729, !730, !735, !740, !742, !747, !752, !754, !759, !762, !765, !768, !773}
!703 = !DILocalVariable(name: "ctx", arg: 1, scope: !701, file: !3, line: 242, type: !238)
!704 = !DILocalVariable(name: "data_end", scope: !701, file: !3, line: 244, type: !44)
!705 = !DILocalVariable(name: "data", scope: !701, file: !3, line: 245, type: !44)
!706 = !DILocalVariable(name: "fib_params", scope: !701, file: !3, line: 246, type: !198)
!707 = !DILocalVariable(name: "eth", scope: !701, file: !3, line: 247, type: !256)
!708 = !DILocalVariable(name: "ip6h", scope: !701, file: !3, line: 248, type: !285)
!709 = !DILocalVariable(name: "iph", scope: !701, file: !3, line: 249, type: !268)
!710 = !DILocalVariable(name: "newiph", scope: !701, file: !3, line: 250, type: !711)
!711 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !712, size: 64)
!712 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "newiphdr", file: !713, line: 3, size: 96, elements: !714)
!713 = !DIFile(filename: "./newip.h", directory: "/home/rohit/cloned/New-IP/xdp/newip_router")
!714 = !{!715, !716, !717, !718, !719, !720}
!715 = !DIDerivedType(tag: DW_TAG_member, name: "src_addr_type", scope: !712, file: !713, line: 5, baseType: !58, size: 8)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "dst_addr_type", scope: !712, file: !713, line: 6, baseType: !58, size: 8, offset: 8)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "addr_cast", scope: !712, file: !713, line: 7, baseType: !58, size: 8, offset: 16)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "dummy", scope: !712, file: !713, line: 8, baseType: !58, size: 8, offset: 24)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "src", scope: !712, file: !713, line: 9, baseType: !71, size: 32, offset: 32)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "dst", scope: !712, file: !713, line: 10, baseType: !71, size: 32, offset: 64)
!721 = !DILocalVariable(name: "h_proto", scope: !701, file: !3, line: 251, type: !46)
!722 = !DILocalVariable(name: "nh_off", scope: !701, file: !3, line: 252, type: !171)
!723 = !DILocalVariable(name: "rc", scope: !701, file: !3, line: 253, type: !102)
!724 = !DILocalVariable(name: "action", scope: !701, file: !3, line: 254, type: !102)
!725 = !DILocalVariable(name: "src", scope: !726, file: !3, line: 288, type: !49)
!726 = distinct !DILexicalBlock(scope: !727, file: !3, line: 287, column: 2)
!727 = distinct !DILexicalBlock(scope: !728, file: !3, line: 286, column: 11)
!728 = distinct !DILexicalBlock(scope: !701, file: !3, line: 264, column: 6)
!729 = !DILocalVariable(name: "dst", scope: !726, file: !3, line: 289, type: !49)
!730 = !DILocalVariable(name: "____fmt", scope: !731, file: !3, line: 320, type: !734)
!731 = distinct !DILexicalBlock(scope: !732, file: !3, line: 320, column: 3)
!732 = distinct !DILexicalBlock(scope: !733, file: !3, line: 311, column: 2)
!733 = distinct !DILexicalBlock(scope: !727, file: !3, line: 310, column: 11)
!734 = !DICompositeType(tag: DW_TAG_array_type, baseType: !91, size: 128, elements: !60)
!735 = !DILocalVariable(name: "____fmt", scope: !736, file: !3, line: 321, type: !737)
!736 = distinct !DILexicalBlock(scope: !732, file: !3, line: 321, column: 3)
!737 = !DICompositeType(tag: DW_TAG_array_type, baseType: !91, size: 112, elements: !738)
!738 = !{!739}
!739 = !DISubrange(count: 14)
!740 = !DILocalVariable(name: "____fmt", scope: !741, file: !3, line: 322, type: !734)
!741 = distinct !DILexicalBlock(scope: !732, file: !3, line: 322, column: 3)
!742 = !DILocalVariable(name: "____fmt", scope: !743, file: !3, line: 323, type: !744)
!743 = distinct !DILexicalBlock(scope: !732, file: !3, line: 323, column: 3)
!744 = !DICompositeType(tag: DW_TAG_array_type, baseType: !91, size: 120, elements: !745)
!745 = !{!746}
!746 = !DISubrange(count: 15)
!747 = !DILocalVariable(name: "____fmt", scope: !748, file: !3, line: 324, type: !749)
!748 = distinct !DILexicalBlock(scope: !732, file: !3, line: 324, column: 3)
!749 = !DICompositeType(tag: DW_TAG_array_type, baseType: !91, size: 264, elements: !750)
!750 = !{!751}
!751 = !DISubrange(count: 33)
!752 = !DILocalVariable(name: "____fmt", scope: !753, file: !3, line: 325, type: !749)
!753 = distinct !DILexicalBlock(scope: !732, file: !3, line: 325, column: 3)
!754 = !DILocalVariable(name: "____fmt", scope: !755, file: !3, line: 326, type: !756)
!755 = distinct !DILexicalBlock(scope: !732, file: !3, line: 326, column: 3)
!756 = !DICompositeType(tag: DW_TAG_array_type, baseType: !91, size: 88, elements: !757)
!757 = !{!758}
!758 = !DISubrange(count: 11)
!759 = !DILocalVariable(name: "____fmt", scope: !760, file: !3, line: 327, type: !761)
!760 = distinct !DILexicalBlock(scope: !732, file: !3, line: 327, column: 3)
!761 = !DICompositeType(tag: DW_TAG_array_type, baseType: !91, size: 16, elements: !366)
!762 = !DILocalVariable(name: "____fmt", scope: !763, file: !3, line: 346, type: !764)
!763 = distinct !DILexicalBlock(scope: !701, file: !3, line: 346, column: 2)
!764 = !DICompositeType(tag: DW_TAG_array_type, baseType: !91, size: 64, elements: !66)
!765 = !DILocalVariable(name: "____fmt", scope: !766, file: !3, line: 350, type: !153)
!766 = distinct !DILexicalBlock(scope: !767, file: !3, line: 350, column: 3)
!767 = distinct !DILexicalBlock(scope: !701, file: !3, line: 348, column: 2)
!768 = !DILocalVariable(name: "____fmt", scope: !769, file: !3, line: 375, type: !770)
!769 = distinct !DILexicalBlock(scope: !701, file: !3, line: 375, column: 2)
!770 = !DICompositeType(tag: DW_TAG_array_type, baseType: !91, size: 96, elements: !771)
!771 = !{!772}
!772 = !DISubrange(count: 12)
!773 = !DILabel(scope: !701, name: "out", file: !3, line: 374)
!774 = !DILocation(line: 0, scope: !701)
!775 = !DILocation(line: 244, column: 38, scope: !701)
